package org.example.lesson_08

//1. Преобразование строк
//Создайте функцию, которая будет анализировать входящие фразы и применять к ним различные преобразования, делая текст более ироничным или забавным. Функция должна уметь распознавать ключевые слова или условия и соответственно изменять фразу.

//Правила проверки и преобразования:

//Если фраза содержит слово "невозможно":
//Преобразование: Замените "невозможно" на "совершенно точно возможно, просто требует времени".
//Если фраза начинается с "Я не уверен":
//Преобразование: Добавьте в конец фразы ", но моя интуиция говорит об обратном".
//Если фраза содержит слово "катастрофа":
//Преобразование: Замените "катастрофа" на "интересное событие".
//Если фраза заканчивается на "без проблем":
//Преобразование: Замените "без проблем" на "с парой интересных вызовов на пути".
//Если фраза содержит только одно слово:
//Преобразование: Добавьте перед словом "Иногда," и после слова ", но не всегда".

fun transform(text: String): String {
    return when {
        "невозможно" in text ->
            text.replace("невозможно", "совершенно точно возможно, просто требует времени")

        text.startsWith("Я не уверен") ->
            "$text, но моя интуиция говорит об обратном"

        "катастрофа" in text ->
            text.replace("катастрофа", "интересное событие")

        text.endsWith("без проблем") ->
            text.replace("без проблем", "с парой интересных вызовов на пути")

        !text.contains(" ") ->
            "Иногда, $text, но не всегда"

        else -> text
    }
}

fun main() {
    println(transform("Это невозможно выполнить за один день"))
    println(transform("Я не уверен в успехе этого проекта"))
    println(transform("Произошла катастрофа на сервере"))
    println(transform("Этот код работает без проблем"))
    println(transform("Удача"))
}

//2. Извлечение даты из строки лога
//У вас есть строка лога, например "Пользователь вошел в систему -> 2021-12-01 09:48:23"
// (данные могут быть любыми, но формат всегда такой). Извлеките отдельно дату и время из этой строки и сразу распечатай их по очереди.
// Используй indexOf или split для получения правой части сообщения.

fun dataAndTime(log: String): String{
    val parts = log.split(" ")
    val n = parts.length

    val date = parts[n - 2]
    val time = parts[n - 1]

    return "$date\n$time"
}

fun main(){
    println(dataAndTime(log = "Пользователь вошел в систему -> 2021-12-01 09:48:23"))
}


// 3. Маскирование личных данных
//Дана строка с номером кредитной карты, например "4539 1488 0343 6467".
// Замаскируйте все цифры, кроме последних четырех, символами "*".

fun mask(card: String): String {
    val cardParts = card.split(" ")
    val n = cardParts.size

    var secretCard = ""

    for (i in 0 until n){
        if (i < n - 1){
            secretCard += "**** "
        } else {
            secretCard += cardParts[i]
        }
    }

    return secretCard
}

fun main(){
    println(mask(card = "4539 1488 0343 6467"))
}


// 4. Форматирование адреса электронной почты.
//У вас есть электронный адрес, например "username@example.com".
// Преобразуйте его в строку "username [at] example [dot] com", используя функцию replace()

fun formatEmail(email: Sting): String{
    return email
        .replace("@", " at")
        .replace(".", " dot")
}

fun main(){
    println(formatEmail("username@example.com"))
}

fun abbreviation(abbr: Sting): String{
    val abbrSplit = abbr.split(" ")
    val n = abbrSplit.size
    var result = ""

    for (i in 0 until n){
        result += abbrSplit[i][0].uppercase()
    }
    return result
}

fun main(){
    println(abbreviation("Министерство Тупых шуток"))
}